app/controllers/api/v1/links_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def get_stats
		id = link_params
		@link = Link.find_by(id: id)