app/controllers/api/v1/links_controller.rb

	def get_link_stats
		id = link_params
		@link = Link.find_by(id: id)
---
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def get_stats
		@country = Link.joins(:visit).group("country").count
		@browser = Link.joins(:visit).group("browser").count
		@city = Link.joins(:visit).group("city").count
		@user_agent = Link.joins(:visit).group("user_agent").count
		@device_type = Link.joins(:visit).group("device_type").count
---
SELECT COUNT(*) AS count_all, country AS country FROM "links" INNER JOIN "ahoy_visits" ON "ahoy_visits"."id" = "links"."visit_id" GROUP BY country
SELECT COUNT(*) AS count_all, browser AS browser FROM "links" INNER JOIN "ahoy_visits" ON "ahoy_visits"."id" = "links"."visit_id" GROUP BY browser
SELECT COUNT(*) AS count_all, city AS city FROM "links" INNER JOIN "ahoy_visits" ON "ahoy_visits"."id" = "links"."visit_id" GROUP BY city
SELECT COUNT(*) AS count_all, user_agent AS user_agent FROM "links" INNER JOIN "ahoy_visits" ON "ahoy_visits"."id" = "links"."visit_id" GROUP BY user_agent
SELECT COUNT(*) AS count_all, device_type AS device_type FROM "links" INNER JOIN "ahoy_visits" ON "ahoy_visits"."id" = "links"."visit_id" GROUP BY device_type