app/controllers/home_controller.rb

	def index
		@link = Link.new
		@top_links = Link.order(clicks: :desc).first(12)
---
SELECT  "links".* FROM "links" ORDER BY "links"."clicks" DESC LIMIT $1  [["LIMIT", 12]]

	def all
		@link = Link.new
		@links = Link.paginate(:page => params[:page], :per_page => 4)
---
SELECT  "links".* FROM "links" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]