app/controllers/links_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."slug" = $1 LIMIT $2  [["slug", "3"], ["LIMIT", 1]]
UPDATE "links" SET "clicks" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["clicks", 1], ["updated_at", "2018-04-29 13:34:02.743032"], ["id", 3]]
SELECT  "links".* FROM "links" WHERE "links"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    if params[:slug]
      @link = Link.find_by(slug: params[:slug])
      url = @link.full_url
      @link.clicked
      @link.save
      redirect_to url, status: :moved_permanently
    else
      @link = Link.find(params[:id])

INSERT INTO "links" ("full_url", "clicks", "created_at", "updated_at", "visit_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_url", "https://mothership.sg"], ["clicks", 0], ["created_at", "2018-04-30 05:32:50.714085"], ["updated_at", "2018-04-30 05:32:50.714085"], ["visit_id", 1]]
---
  def create
    @link = Link.new(link_params)
    respond_to do |format|
      if @link.save

SELECT  "links".* FROM "links" WHERE "links"."slug" = $1 LIMIT $2  [["slug", "3"], ["LIMIT", 1]]
---
    def set_link
      @link = Link.find_by(slug: params[:slug])