app/models/link.rb

	def generate_slug(encoding="base32")
		# self.slug = self.id.to_s(36)
    self.slug = BaseEncoder.encode(self.id, encoding)
		self.save
---
UPDATE "links" SET "slug" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["slug", "1"], ["updated_at", "2018-04-30 05:32:50.725621"], ["id", 1]]

	def clicked
		self.clicks += 1
		self.save
---
UPDATE "links" SET "clicks" = $1, "updated_at" = $2 WHERE "links"."id" = $3  [["clicks", 2], ["updated_at", "2018-04-30 05:09:14.047643"], ["id", 3]]